"""
7. Напишіть функцію, яка приймає 2 списки. 
Результатом має бути новий список, 
в якому знаходяться елементи першого списку, 
яких немає в другому. 
Порядок елементів, що залишилися має відповідати 
порядку в першому (оригінальному) списку. 
Реалізуйте обчислення за допомогою генератора.
    Приклад:
    array_diff([1, 2], [1]) --> [2]
    array_diff([1, 2, 2, 2, 4, 3, 4], [2]) --> [1, 4, 3, 4]
"""


def unique_list(lst_1, lst_2):
    return [i for i in lst_1 if i not in lst_2]


if __name__ == '__main__':
    print(unique_list([1, 2, 2, 2, 4, 3, 4], [2]))
 