"""
4. Створіть функцію <morse_code>, яка приймає на вхід рядок 
у вигляді коду Морзе та виводить декодоване значення 
(латинськими літерами).
   Особливості:
    - використовуються лише крапки, тире і пробіли (.- )
    - один пробіл означає нову літеру
    - три пробіли означають нове слово
    - результат може бути case-insensetive 
    (на ваш розсуд - велики чи маленькими літерами).
    - для простоти реалізації - цифри, знаки пунктуацїї, 
    дужки, лапки тощо використовуватися не будуть. Лише латинські літери.
    - додайте можливість декодування сервісного сигналу SOS (...---...)
    Приклад:
    --. . . -.- .... ..- -...   .. ...   .... . .-. .
    результат: GEEKHUB IS HERE (edited) 
"""


def morse_code(morse_string):
    morse_dict = {
        ".-": "A", "-...": "B", "-.-.": "C", "-..": "D", ".": "E",
        "..-.": "F", "--.": "G", "....": "H", "..": "I", ".---": "J",
        "-.-": "K", ".-..": "L", "--": "M", "-.": "N", "---": "O",
        ".--.": "P", "--.-": "Q", ".-.": "R", "...": "S", "-": "T",
        "..-": "U", "...-": "V", ".--": "W", "-..-": "X", "-.--": "Y",
        "--..": "Z",'...---...': 'SOS'
        
    }

    decoded_message = []
    for word in morse_string.split('   '):
        decoded_word = ''
        for letter in word.split():
            if letter in morse_dict:
                decoded_word += morse_dict[letter]
        decoded_message.append(decoded_word)

    return ' '.join(decoded_message)


if __name__ == '__main__':
    print(morse_code("...---...   --. . . -.- .... ..- -...   .. ...   .... . .-. ."))
 